{
	"datasets": [{
		"id": 1,
		"name": "Getting_Start",
		"filename": "basic.csv",
		"ext": "csv",
		"category": "Tutorial",
		"row": 50,
		"col": 4,
		"target": "ObjFunc",
		"description": "A small dataset of 3 parameters each ranging values between 1 and 10."
	}, {
		"id": 2,
		"name": "Sinusoidal",
		"filename": "sinusoidal.csv",
		"ext": "csv",
		"category": "Tutorial",
		"row": 500,
		"col": 4,
		"target": "Target",
		"description": "The sinusoidal data demonstrates AiSara capability to learn pattern with minimal data. This is how AiSara is different than an artificial neural network. Plot X1 vs Target with the same X2 (for example, when X2 = 3) to see the pattern and try to fill up the blanks spaces using PREDICT."
	}, {
		"id": 3,
		"name": "History_Matching_6v",
		"filename": "history_match_6v.csv",
		"ext": "csv",
		"category": "Oil_and_Gas",
		"row": 51,
		"col": 7,
		"target": "hm_error",
		"description": "The history match data is from oil and gas reservoir simulation example. The current results are not yet optimised and we can use Aisara to investigate the possible outcome of runs that we haven't done yet, the benefit here is saving time and understanding the results.\r\n\r\nExample: \r\n\r\nSelect the anchor cell for data at Cell A1.\r\nIn cell J7 enter LEARN(B9:G50,H9:H50). (Available for AiSara Pro, where we can use more than 4 variables).\r\nIn cell J51 Using the formula PREDICT(J7,B56:G56,1) as input we can get 0.031987 as our prediction. In our case that is actually quite close to actual simulation results, which was 0.03133."
	}, {
		"id": 4,
		"name": "Logs",
		"filename": "logs.csv",
		"ext": "csv",
		"category": "Oil_and_Gas",
		"row": 10890,
		"col": 5,
		"target": "permeability",
		"description": "Large data set of 4 subsurface logs : Depth, Water Saturation, Porosity and Gamma Ray. With a prediction of permeability as the output. Create pseudo log from this existing data or Use Predict() feature to predict the outcome of area where we do not have permeability, provided that we have some of the input.\r\n\r\nExample :\r\n\r\nSelect the anchor cell for data at Cell A1.\r\nIn cell J5 enter LEARN(B7:D4000,F7:F4000).\r\nIn cell J4001 until J5039 Using the formula PREDICT($J$5,B4001:D4001,1) as input we can get as our prediction. Drag the formula down to cell J5039, and let AiSara do the prediction for you. You can observe that AiSara managed to predict the permeability well in new depths."
	}, {
		"id": 5,
		"name": "Logs_Mini",
		"filename": "logs_mini.csv",
		"ext": "csv",
		"category": "Oil_and_Gas",
		"row": 50,
		"col": 5,
		"target": "permeability",
		"description": "A smaller version data set of logs (which can be found under oil and gas, logs data set), with the output as permeability. From here, we can see how is the performance of AiSara with small data sets as compared to large data sets. AiSara learns better when there are more data to learn from, and this data set shows how AiSara prediction could deviate her accuracy when there is insufficient data."
	}, {
		"id": 6,
		"name": "Production",
		"filename": "production.csv",
		"ext": "csv",
		"category": "Oil_and_Gas",
		"row": 10,
		"col": 10,
		"target": "1st month prod,3rd month prod,6th month prod,1st year prod,2nd year prod,3rd year prod,5th year prod",
		"description": "A synthetic reservoir\/fluid input data set that demonstrates how AiSara can help to create decline production forecast with sensitivity analysis.\r\nInput: (3) permeability, oil viscosity, oil pay thickness from 100 wells.\r\nOutput: Forecast (Time)"
	}, {
		"id": 7,
		"name": "Recovery_Factor",
		"filename": "rf.csv",
		"ext": "csv",
		"category": "Oil_and_Gas",
		"row": 151,
		"col": 9,
		"target": "Actual RF",
		"description": "Often time, we want to be able to gauge recovery factor of a reservoir based on analog. This dataset is an example of how this can be done. Using the LEARN function as you would use any other Excel function, AiSara can learn the relationship between the input and output You can also use the LEARN menu above if you like. Then you can predict the RF using the PREDICT function. Do you have enough data to make a reliable prediction? Check out our BLINDTEST feature to find out."
	}, {
		"id": 8,
		"name": "Sale_Price",
		"filename": "House_Sale_Price.csv",
		"ext": "csv",
		"category": "Housing",
		"row": 1460,
		"col": 5,
		"target": "SalePrice",
		"description": "AiSara can predict the price of houses based on the variables of this dataset which are:.1) Overall Quality Rating (Out of 10).2) Overall Condition Rating (Out of 10).3) The Year when the house was built.4) The Year when the house was remodified.5) Output : Sale Price. AiSara is able to handle the 1400+ rows of data, and learn from it. Due to the omission of variables and some in noise this data set, the average error may be present. Reword, it doe't sound right."
	}, {
		"id": 9,
		"name": "Credit_Card_Fraud_Detection",
		"filename": "Credit_Card_Fraud_Kaggle.csv",
		"ext": "csv",
		"category": "Banking",
		"row": 1582,
		"col": 31,
		"target": "Class",
		"description": "The datasets contains transactions made by credit cards in September 2013 by european cardholders. It contains only numerical input variables which are V1 to V28, and due to confidentiality the variables are named that way. These variables have been given numerical values which has undergone PCA transformation. AISara can learn the input variables of Time, V1 to V28, and Amount against the output, Class (where 1 is fraud, and 0 is non-fraud), and predict potential credit card fraud based on the input variables. You can try out and learn all 30 variables with AiSara Pro."
	}]
}